"""
Исследовать влияние характеристик атрибутов программного проекта
(MODP, TOOL) на трудоемкость (РМ) и время разработки проекта
(ТМ) для базового уровня модели COCOMO и разных типов проектов
(обычного, встроенного, промежуточного). Для этого получить
значения PM и ТМ по всем типам проектов для одного и того же
значения параметра SIZE (размера программного кода) при изменении
значений атрибутов проекта от низких до высоких. Проанализировать
как повлияет на трудоемкость и время реализации проекта внесение
дополнительных ограничений на требуемые сроки разработки
(параметр SCED). Результаты исследований оформить графически и
сделать соответствующие выводы.
"""

"""
Трудозатраты = С1 * EAF * (Размер)^p1 (количество человеко-месяцев)

C1 - масштабируемый коэффициент
EAF - уточняющий фактор, хар-ий предметную область/персонал/среду/инструментарий, 
используемый для создания рабочих продуктов процесса
Размер - размер конечного продукта (кода, созданного человеком)
p1 - показатель степени, хар-ий экономию при больших масштабах, присущую тому 
процессу, который используется для создания конечного продукта; 
в частности, способность процесса избегать непроизводительных видов 
деятельности (доработок, бюрократических проволочек, накладных расходов)

Время = С2 * (Трудозатраты)^p2 (общее количество месяцев)

С2 - масштабирующий коэффициент для сроков исполнения
Р2 - показатель степени, характеризует инерцию и распараллеливание, присущие 
управлению разработкой ПО
"""

if __name__ == '__main__':
    doTask1()

